

module.exports = {
	obj:{},
    getErrorCode: function(code) {

        obj[40020] ='该用户未被注册！'
        obj[4002] ='该用户早已经被注册！'
        obj[200] = '操作成功'
        obj[4009] ='该用户没有注册'
        obj[4010] ='该用户已经被停用了,请联系管理员'
        obj[4011] ='该个用户已经被冻结了,请联系管理员'
        obj[4007] ='用户重要信息加密失败'
        obj[4015] ='修改用户信息失败'
        obj[4007] ='该用户修改密码失败'
        obj[4014] ='参数不足'
        obj[4018] ='banner类型非法'
        obj[4019] ='最大个数，不能再添加了'
        obj[4022] ='不能编辑'
        obj[4023] ='不能删除'

        return obj[code]
    },
}